Repository: bogdanbabych/0945BUT10201-lex2
Catalog: data/s01rawFiles/gnu-en--de-v03.tmx
Source language: en
Languages: de

source: About the GNU Operating System The name “GNU” is a recursive acronym for “GNU's Not Unix!”; it is pronounced as one syllable with a hard g.
de: Informationen zum GNU-Betriebssystem Der Name GNU ist ein rekursives Akronym von GNU’s Not Unix (‚GNU ist nicht Unix‘) und wird [ˈgnuː] ausgesprochen.

source: [Other historical and general articles about GNU.]
de: [Weitere historische und allgemeine Artikel über GNU.]

source: GNU was launched by Richard Stallman (rms) in 1983, as an operating system which would be put together by people working together for the freedom of all software users to control their computing.
de: GNU wurde von Richard Stallman (RMS) im Jahr 1983 als ein Betriebssystem angekündigt, welches von engagierten Menschen zusammengestellt werden würde, die für die Freiheit aller Softwarenutzer zusammenarbeiten, um ihre Datenverarbeitung kontrollieren zu können.

source: rms remains the Chief GNUisance today.
de: RMS ist auch heute noch der Chief GNUisance.

source: The primary and continuing goal of GNU is to offer a Unix-compatible system that would be 100% free software.
de: Das primäre und anhaltende Ziel von GNU ist ein unixoides System anzubieten, das 100 % Freie Software wäre.

source: Not 95% free, not 99.5%, but 100%.
de: Nicht 95%ig, nicht 99,5%ig, sondern 100%ig frei.

source: The name of the system, GNU, is a recursive acronym meaning GNU's Not Unix—a way of paying tribute to the technical ideas of Unix, while at the same time saying that GNU is something different.
de: Der Name des Systems, GNU, ist ein rekursives Akronym von GNU’s Not Unix (‚GNU ist Nicht Unix‘) ‑ eine Art, den technischen Ideen von Unix Tribut zu zollen und gleichzeitig zu sagen, dass GNU etwas anderes ist.

source: Technically, GNU is like Unix.
de: Technisch gesehen ist GNU wie Unix.

source: But unlike Unix, GNU gives its users freedom.
de: Aber im Gegensatz zu Unix gibt GNU seinen Benutzern Freiheit.

source: Completely free system distributions (“distros”) meeting this goal are available today, many using the Linux-libre kernel (the relationship between GNU and the Linux kernel is described more fully elsewhere).
de: Vollständig freie Distributionen, die diesem Ziel entsprechen, stehen heute zur Verfügung, viele mit dem GNU Linux-libre-Betriebssystemkern (die Beziehung zwischen GNU und dem Betriebssystemkern Linux wird an anderer Stelle umfassend beschrieben).

source: The GNU packages have been designed to work together so we could have a functioning GNU system.
de: Die GNU-Pakete wurden so aufeinander abgestimmt, damit wir ein funktionierendes GNU-System haben konnten.

source: It has turned out that they also serve as a common “upstream” for many distros, so contributions to GNU packages help the free software community as a whole.
de: Es hat sich gezeigt, dass sie auch als gemeinsamer Upstream für viele Distributionen dienen, also Beiträge zu GNU-Paketen der Freie-Software-Gemeinschaft als Ganzes helfen.

source: Naturally, work on GNU is ongoing, with the goal to create a system that gives the greatest freedom to computer users.
de: Natürlich ist die Arbeit an GNU noch nicht mit dem Ziel abgeschlossen, ein System zu erstellen, das Rechnernutzern die größtmögliche Freiheit gibt.

source: GNU packages include user-oriented applications, utilities, tools, libraries, even games—all the programs that an operating system can usefully offer to its users.
de: GNU-Pakete beinhalten benutzerorientierte Anwendungen, Dienstprogramme, Hilfsprogramme, Bibliotheken, sogar Spiele ‑ alle Programme, die ein Betriebssystem seinen Nutzern zweckmäßigerweise anbieten kann.

source: New packages are welcome.
de: Neue Pakete sind willkommen …

source: Thousands of people have joined in to make GNU the success it is today, and there are many ways to contribute, both technical and non-technical.
de: Tausende von Menschen haben sich angeschlossen, um GNU so erfolgreich zu machen wie es heute ist, und es gibt viele Möglichkeiten um mitzuwirken, sowohl technisch als auch nichttechnisch.

source: GNU developers gather from time to time in GNU Hackers Meetings, sometimes as part of the larger free software community LibrePlanet conferences.
de: GNU-Entwickler treffen sich von Zeit zu Zeit auf GNU Hacker Meetings, manchmal als Teil der größeren Freie-Software-Gemeinschaft LibrePlanet-Konferenzen.

source: GNU has been supported in several ways by the Free Software Foundation, the nonprofit organization also founded by rms to advocate free software ideals.
de: GNU wurde auf verschiedene Weise von der Free Software Foundation (FSF) unterstützt, eine ebenfalls von RMS gegründete gemeinnützige Organisation, um für Freie-Software-Ideale einzutreten.

source: Among other things, the FSF accepts copyright assignments and disclaimers, so it can act in court on behalf of GNU programs.
de: Unter anderem akzeptiert die FSF Copyright-Übertragungen und Verzichtserklärungen, damit sie vor Gericht im Namen der GNU-Programme fungieren kann (zur Klarstellung: ein Programm zu GNU beizutragen, erfordert nicht das Copyright an die FSF zu übertragen.

source: (To be clear, contributing a program to GNU does not require transferring copyright to the FSF.
de: Wenn man das Copyright zuweist, wird die FSF die GNU GPL für das Programm durchsetzen, sollte jemand dagegen zuwider handeln; behält man das Copyright, liegt die Durchsetzung bei Ihnen.)

source: If you do assign copyright, the FSF will enforce the GPL for the program if someone violates it; if you keep the copyright, enforcement will be up to you.)
de: Das endgültige Ziel ist Freie Software bereitzustellen, damit Rechnernutzer alle Aufgaben erledigen können, die sie möchten ‑ und so proprietäre Software zu einer Sache der Vergangenheit zu machen. ⮝

source: The ultimate goal is to provide free software to do all of the jobs computer users want to do—and thus make proprietary software a thing of the past.
de: [FSF] Die Free Software Foundation (FSF) ist eine gemeinnützige Organisation mit einer weltweiten Mission die Freiheit von Rechnernutzern zu fördern. Wir verteidigen die Rechte aller Softwarenutzer.

source: [FSF logo] “The Free Software Foundation (FSF) is a nonprofit with a worldwide mission to promote computer user freedom.
de: Mitmachen Spenden Shoppen Bitte senden Sie allgemeine Fragen zur FSF & GNU an <gnu@gnu.org>.

source: We defend the rights of all software users.”
de: Sie können auch die Free Software Foundation kontaktieren.

source: JOIN DONATE SHOP Please send general FSF & GNU inquiries to <gnu@gnu.org>.
de: Ungültige Verweise und andere Korrekturen oder Vorschläge können an <webmasters@gnu.org> gesendet werden.

source: There are also other ways to contact the FSF.
de: Bei der Übersetzung dieses Werkes wurde mit größter Sorgfalt vorgegangen.

source: Broken links and other corrections or suggestions can be sent to <webmasters@gnu.org>.
de: Trotzdem können Fehler nicht völlig ausgeschlossen werden. Sollten Sie Fehler bemerken oder Vorschläge, Kommentare oder Fragen zu diesem Dokument haben, wenden Sie sich bitte an unser Übersetzungsteam <web-translators@gnu.org>.

source: Please see the Translations README for information on coordinating and submitting translations of this article.
de: Weitere Informationen über die Koordinierung und Einsendung von Übersetzungen unserer Internetpräsenz finden Sie in der LIESMICH für Übersetzungen.

source: Copyright © 2014, 2017, 2018 Free Software Foundation, Inc.
de: Copyright © 2011, 2014, 2017 Free Software Foundation, Inc.

source: This page is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License.
de: Dieses Werk ist lizenziert unter einer Creative Commons Namensnennung-Keine Bearbeitungen 4.0 International-Lizenz.

source: Copyright Infringement Notification
de: Mitteilung einer Urheberrechtsverletzung.

source: What is free software?
de: Freie Software. Was ist das?

source: The Free Software Definition Have a question about free software licensing not answered here?
de: Freie-Software-Definition Haben Sie eine hier nicht beantwortete Frage bezüglich Freie-Software-Lizenzierung?

source: See our other licensing resources, and if necessary contact the FSF Compliance Lab at licensing@fsf.org.
de: Siehe auch unsere weiteren Ressourcen zur Lizenzierung, bei unbeantworteten Anliegen wenden Sie sich bitte unter licensing@fsf.org an das FSF Compliance Lab.

source: The free software definition presents the criteria for whether a particular software program qualifies as free software.
de: Die Freie-Software-Definition soll verdeutlichen, welche Kriterien ein einzelnes Softwareprogramm erfüllen muss um als Freie Software betrachtet zu werden.

source: From time to time we revise this definition, to clarify it or to resolve questions about subtle issues.
de: Von Zeit zu Zeit wird diese Definition überarbeitet, um dies zu verdeutlichen oder Fragen zu subtilen Problemen zu lösen.

source: See the History section below for a list of changes that affect the definition of free software.
de: Weitere Informationen zu gemachten Änderungen sind unter Historie zu finden.

source: “Open source” is something different: it has a very different philosophy based on different values.
de: Die „Open-Source“-Definition ist etwas anderes: eine ganz andere Philosophie, die auf anderen Werten beruht.

source: Its practical definition is different too, but nearly all open source programs are in fact free.
de: Auch die praktische Definition ist anders, jedoch sind alle quelloffenen Programme in der Tat beinahe frei.

source: We explain the difference in Why “Open Source” misses the point of Free Software.
de: Den Unterschied erklären wir in Warum „Open Source“ das Ziel Freie Software verfehlt.

source: “Free software” means software that respects users' freedom and community.
de: Freie Software ist Software, die die Freiheit und Gemeinschaft der Nutzer respektiert.

source: Roughly, it means that the users have the freedom to run, copy, distribute, study, change and improve the software.
de: Ganz allgemein bedeutet das, dass Nutzer die Freiheit haben Software auszuführen, zu kopieren, zu verbreiten, zu untersuchen, zu ändern und zu verbessern.

source: Thus, “free software” is a matter of liberty, not price.
de: Freie Software ist daher eine Frage der Freiheit, nicht des Preises.

source: To understand the concept, you should think of “free” as in “free speech,” not as in “free beer”.
de: Um das Konzept zu verstehen sollte man an frei wie in Redefreiheit denken, nicht wie in Freibier.

source: We sometimes call it “libre software,” borrowing the French or Spanish word for “free” as in freedom, to show we do not mean the software is gratis.
de: Manchmal nennen wir sie auch Libre Software, dem französischen bzw. spanischen Wort für frei wie in Freiheit entlehnt, um deutlich zu machen, dass wir uns keinesfalls auf Software beziehen die gratis sei.

source: We campaign for these freedoms because everyone deserves them.
de: Wir kämpfen für diese Freiheiten, weil sie jedermann verdient.

source: With these freedoms, the users (both individually and collectively) control the program and what it does for them.
de: Mit diesen Freiheiten kontrollieren Nutzer (sowohl einzeln als auch gemeinsam) das Programm und was es für sie ausführt.

source: When users don't control the program, we call it a “nonfree” or “proprietary” program.
de: Wenn nicht Nutzer das Programm kontrollieren, nennen wir es ein unfreies bzw. proprietäres Programm.

source: The nonfree program controls the users, and the developer controls the program; this makes the program an instrument of unjust power.
de: Das unfreie Programm kontrolliert die Nutzer, und der Entwickler kontrolliert das Programm.

source: The four essential freedoms A program is free software if the program's users have the four essential freedoms: [1]
de: Dies macht das Programm zu einem Instrument ungerechter Macht.

source: The freedom to run the program as you wish, for any purpose (freedom 0).
de: Vier wesentliche Freiheiten Ein Programm ist Freie Software, wenn Nutzer eines Programms über vier wesentliche Freiheiten[1] verfügen:

source: The freedom to study how the program works, and change it so it does your computing as you wish (freedom 1).
de: Die Freiheit, das Programm auszuführen wie man möchte, für jeden Zweck (Freiheit 0).

source: Access to the source code is a precondition for this.
de: Die Freiheit, die Funktionsweise des Programms zu untersuchen und eigenen Datenverarbeitungbedürfnissen anzupassen (Freiheit 1).

source: The freedom to redistribute copies so you can help others (freedom 2).
de: Der Zugang zum Quellcode ist dafür Voraussetzung.

source: The freedom to distribute copies of your modified versions to others (freedom 3).
de: Die Freiheit, das Programm zu redistribuieren und damit Mitmenschen zu helfen (Freiheit 2).

source: By doing this you can give the whole community a chance to benefit from your changes.
de: Die Freiheit, das Programm zu verbessern und diese Verbesserungen der Öffentlichkeit freizugeben, damit die gesamte Gesellschaft davon profitiert (Freiheit 3).

source: A program is free software if it gives users adequately all of these freedoms.
de: Ein Programm ist freie Software, wenn es Nutzern adäquat all diese Freiheiten gewährt.

source: Otherwise, it is nonfree.
de: Ansonsten ist es unfrei.

source: While we can distinguish various nonfree distribution schemes in terms of how far they fall short of being free, we consider them all equally unethical.
de: Solange wir verschiedene unfreie Vertriebsschemata in Bezug darauf unterscheiden können, inwieweit sie dahinter zurückbleiben frei zu sein, betrachten wir sie alle gleichermaßen als unethisch.

source: In any given scenario, these freedoms must apply to whatever code we plan to make use of, or lead others to make use of.
de: In jedem angenommenen Szenario müssen diese Freiheiten zutreffen ‑ welchen Quellcode auch immer wir beabsichtigen zu benutzen (oder andere bewegen zu benutzen).

source: For instance, consider a program A which automatically launches a program B to handle some cases.
de: Betrachten wir beispielsweise ein Programm namens A, das automatisch ein Programm namens B startet um irgendetwas zu verarbeiten.

source: If we plan to distribute A as it stands, that implies users will need B, so we need to judge whether both A and B are free.
de: Wenn wir beabsichtigen A unverändert zu distribuieren, impliziert das, dass dessen Nutzer B ebenfalls benötigen ‑ wir müssen somit entscheiden ob sowohl A als auch B frei sind.

source: However, if we plan to modify A so that it doesn't use B, only A needs to be free; B is not pertinent to that plan.
de: Wenn wir beabsichtigen A so zu modifizieren, damit es B nicht mehr benötigt, muss nur A frei sein, B ist für dieses Vorhaben nicht relevant.

source: “Free software” does not mean “noncommercial”.
de: Freie Software ist nicht gleichbedeutend mit unkommerziell.

source: A free program must be available for commercial use, commercial development, and commercial distribution. Commercial development of free software is no longer unusual; such free commercial software is very important.
de: Ein freies Programm muss für die kommerzielle Nutzung, die kommerzielle Entwicklung und den kommerziellen Vertrieb verfügbar sein.

source: You may have paid money to get copies of free software, or you may have obtained copies at no charge.
de: Die kommerzielle Entwicklung von freier Software ist nicht mehr unüblich.

source: But regardless of how you got your copies, you always have the freedom to copy and change the software, even to sell copies.
de: Solche freie kommerzielle Software ist sehr wichtig.

source: A free program must offer the four freedoms to any user that obtains a copy of the software, provided the user has complied thus far with the conditions of the free license covering the software.
de: Möglicherweise hat man Geld für Kopien freier Software ausgegeben oder Kopien unentgeltlich erhalten.

source: Putting some of the freedoms off limits to some users, or requiring that users pay, in money or in kind, to exercise them, is tantamount to not granting the freedoms in question, and thus renders the program nonfree.
de: Aber egal wie man die Kopien erhalten hat, man hat immer die Freiheit die Software zu kopieren und zu ändern, sogar Kopien zu verkaufen.

source: Clarifying the line at various points In the rest of this article we explain more precisely how far the various freedoms need to extend, on various issues, in order for a program to be free.
de: Der weitere Text erläutert, was bestimmte Freiheiten adäquat macht oder nicht.

source: The freedom to run the program as you wish The freedom to run the program means the freedom for any kind of person or organization to use it on any kind of computer system, for any kind of overall job and purpose, without being required to communicate about it with the developer or any other specific entity. In this freedom, it is the user's purpose that matters, not the developer's purpose; you as a user are free to run the program for your purposes, and if you distribute it to someone else, she is then free to run it for her purposes, but you are not entitled to impose your purposes on her.
de: Die Freiheit, das Programm auszuführen wie man möchte Die Freiheit, das Programm auszuführen bedeutet für jegliche Person oder Organisation die Freiheit zu haben, es auf jedem beliebigen Rechner für jede Art von Aufgabe und Zweck nutzen zu dürfen, ohne darüber mit dem Entwickler oder irgendeinem Unternehmen kommunizieren zu müssen.

source: The freedom to run the program as you wish means that you are not forbidden or stopped from making it run.
de: In dieser Freiheit ist der Nutzer das Ziel, nicht der Entwickler!

source: This has nothing to do with what functionality the program has, whether it is technically capable of functioning in any given environment, or whether it is useful for any particular computing activity.
de: Dem Nutzer steht es frei das Programm für eigene Zwecke auszuführen, und wenn man es an jemand anderen weitergibt, steht es dieser Person dann frei es für eigene Zwecke auszuführen, aber man ist nicht berechtigt, ihr eigene Absichten aufzuerlegen.

source: For example, if the code arbitrarily rejects certain meaningful inputs—or even fails unconditionally—that may make the program less useful, perhaps even totally useless, but it does not deny users the freedom to run the program, so it does not conflict with freedom 0.
de: Die Freiheit, das Programm auszuführen wie man möchte bedeutet, dass einem nicht untersagt oder davon abgehalten wird, es auszuführen.

source: If the program is free, the users can overcome the loss of usefulness, because freedoms 1 and 3 permit users and communities to make and distribute modified versions without the arbitrary nuisance code.
de: Dies hat nichts mit der Funktionalität des Programm zu tun, ob es technisch dazu in der Lage ist in einer bestimmten Umgebung zu funktionieren oder ob es für einen bestimmten Bereich der Datenverarbeitung sinnvoll ist.

source: The freedom to study the source code and make changes In order for freedoms 1 and 3 (the freedom to make changes and the freedom to publish the changed versions) to be meaningful, you need to have access to the source code of the program.
de: Die Freiheit, den Quellcode zu untersuchen und Änderungen vorzunehmen Damit Freiheit 1 und 3 (die Freiheiten, Änderungen vorzunehmen und geänderte Versionen zu veröffentlichen) sinnvoll sind, müssen Nutzer Zugang zum Quellcode des Programms haben.

source: Therefore, accessibility of source code is a necessary condition for free software.
de: Daher ist die Zugänglichkeit des Quellcodes eine notwendige Bedingung für Freie Software.

source: Obfuscated “source code” is not real source code and does not count as source code.
de: Verschleierter „Quellcode“ ist nicht wirklich Quellcode und zählt nicht als solcher.

source: Freedom 1 includes the freedom to use your changed version in place of the original.
de: Freiheit 1 umfasst die Freiheit, die eigene geänderte Version anstelle des Originals zu verwenden.

source: If the program is delivered in a product designed to run someone else's modified versions but refuse to run yours — a practice known as “tivoization” or “lockdown”, or (in its practitioners' perverse terminology) as “secure boot” — freedom 1 becomes an empty pretense rather than a practical reality.
de: Kommt das Programm in einem Produkt zum Einsatz, in dem die modifizierte Version eines Dritten, nicht jedoch die eigene ‑ eine als Tivoisierung bzw. Abriegelung (engl. ‚Lockdown‘) oder (in seiner praktizierenden perversen Terminologie) als „Secure Boot“[*] bekannte Praxis ‑ ausgeführt wird, wird Freiheit 1 eher zu einem fadenscheinigen Vorwand anstatt einer praktischen Realität.

source: These binaries are not free software even if the source code they are compiled from is free.
de: Diese Binärdateien sind nicht freie Software, selbst wenn der Quellcode, von dem sie kompiliert werden, frei ist.

source: One important way to modify a program is by merging in available free subroutines and modules.
de: Die Zusammenführung der verfügbaren freien Unterroutinen und -modulen ist eine wichtige Möglichkeit ein Programm zu modifizieren.

source: If the program's license says that you cannot merge in a suitably licensed existing module — for instance, if it requires you to be the copyright holder of any code you add — then the license is too restrictive to qualify as free.
de: Wenn die Programmlizenz eines entsprechend lizenzierten vorhandenen Moduls die Zusammenführung untersagt ‑ beispielsweise wenn man nicht der Copyrightinhaber des hinzuzufügenden Quellcodes ist ‑ dann ist die Lizenz zu restriktiv, um sich als frei zu qualifizieren.

source: Whether a change constitutes an improvement is a subjective matter.
de: Ob eine Änderung eine Verbesserung darstellt, ist eine subjektive Angelegenheit.

source: If your right to modify a program is limited, in substance, to changes that someone else considers an improvement, that program is not free.
de: Wenn das Recht ein Programm zu modifizieren im Wesentlichen auf Änderungen beschränkt wird, die jemand anderes als Verbesserung betrachtet, ist das Programm unfrei.

source: The freedom to redistribute if you wish: basic requirements Freedom to distribute (freedoms 2 and 3) means you are free to redistribute copies, either with or without modifications, either gratis or charging a fee for distribution, to anyone anywhere.
de: Die Freiheit zu redistribuieren, wenn man möchte: grundlegende Anforderungen Die Freiheit, das Programm zu redistribuieren und […] der Öffentlichkeit freizugeben (Freiheit 2 und 3) bedeutet, dass man die Freiheit hat Kopien an jedermann überall weiterzugeben (entweder mit oder ohne Modifikationen, gratis oder gegen Gebühr für den Vertrieb).

source: Being free to do these things means (among other things) that you do not have to ask or pay for permission to do so.
de: Frei sein bedeutet, diese Dinge (unter anderem) vornehmen zu können, ohne fragen oder für die Berechtigung zahlen zu müssen.

source: You should also have the freedom to make modifications and use them privately in your own work or play, without even mentioning that they exist.
de: Außerdem sollte man auch die Freiheit haben Modifikationen vorzunehmen und privat im eigenen Werk oder Spiel zu nutzen, ohne auch nur deren Existenz zu erwähnen.

source: If you do publish your changes, you should not be required to notify anyone in particular, or in any particular way.
de: Veröffentlicht man die Änderungen, sollte es nicht erforderlich sein, irgendjemand im Besonderen oder auf irgendeine bestimmte Weise zu benachrichtigen.
